#ifndef __GPIO_H
#define __GPIO_H	 
#include "sys.h"
#include "config.h"


#define Dead_MCU_Action	PCout(15)

#define Dead_MCU_CTR_ON		Dead_MCU_Action = 0
#define Dead_MCU_CTR_OFF	Dead_MCU_Action = 1

/**
************************************************************************************************************************
 * @Function 	:		void GPIO_init(void) 
 * @author		: 	xiaowine@cee0.com
 * @brief 		: 	ÅäÖÃIOÊäÈë
 * @param 		: 	
 * @Return  	:		None
 * @Ëµ	Ã÷  	:		
************************************************************************************************************************
*/
void GPIO_init(void);
/**
************************************************************************************************************************
 * @Function 	:		
 * @author		: 	xiaowine@cee0.com
 * @brief 		: 	¼à²âÍ¨µÀ×´Ì¬
 * @param 		: 	u16 *temp ¸÷Í¨µÀ×´Ì¬ Î»±íÊ¾ d0Î»±íÊ¾Í¨µÀ0
 * @Return  	:		None
 * @Ëµ	Ã÷  	:		
************************************************************************************************************************
*/
u16 IO_States(uFLAG *temp1);
/**
************************************************************************************************************************
 * @Function 	:		void CRT_IO(void)
 * @author		: 	xiaowine@cee0.com
 * @brief 		: 	
 * @param 		: 	
 * @Return  	:		None
 * @?µ?÷			:		
************************************************************************************************************************
*/
void CRT_IO(void);






































#endif














